"""
Лабораторна робота: Варіант 2
Студент: [Осін Ростислав]
Група: [EIP-30]
"""

# Задача 1: Перемикання режимів автопілота (вкладений if)
from math import sqrt


def get_autopilot_mode(h: float, v: float) -> str:
    """
    Залежно від висоти h (м) та швидкості v (км/год):
    - h > 10000 та v > 800 -> "Круїз"
    - h < 500 та v < 250 -> "Захід на посадку"
    - в інших випадках -> "Ручне управління"
    """
    #Перевірка яка висота, спочатку чи більше ніж 10000
    if h > 10000:     
        if v > 800:                 #якщо висота більша за 10000, то перевіряємо швидкість, якщо швидкість більше 800, то вивсети "Круїз"
            return "Круїз"
    elif h < 500:                   #Якщо висота не більше 10000, перевіряємо чи менше за 500
        if v < 250:                 #Якщо висота менша за 500, перевірка швидкості, що нижче за 250, якщо так, то вивсети "Захід на посадку"
         return "Захід на посадку"
    
    return "Ручне управління"       #Якщо до цього нічого не підійшло, вивести "Ручне управління"

# Задача 2: Декодер команд ступенів (match-case)
def decode_stage_command(stage_data: tuple) -> str:
    """
    Прийає кортеж (stage_id, fuel_level, speed).
    Зіставляє шаблони:
    - stage_id == 1, fuel == 0 -> "Відстиковка 1-го ступеня"
    - stage_id 2 або 3 (через |), fuel == 0 -> "Відстиковка {stage_id}-го ступеня"
    - штатно -> "Ступінь {stage_id}: паливо {fuel_level}%, швидкість {speed} м/с"
    """
    match stage_data:
        case (1, 0, *_):                                      #Перевірка, якщо stage_id 1, а fuel_level 0, то вивести "Відстиковка 1-го ступеня"
            return "Відстиковка 1-го ступеня"                 #Виводимо повідомлення про відстиковку 1-го ступеня
        case ((2  |3) as stage_id, 0, *_):                    #Перевірка, якщо stage_id 2 або 3, а fuel_level 0, то вивести "Відстиковка {stage_id}-го ступеня"
            return f"Відстиковка {stage_id}-го ступеня"       #Виводимо повідомлення про відстиковку {stage_id}-го ступеня
        case (stage_id, fuel_level, speed):                   #Перевірка, якщо жоден з попередніх шаблонів не відповідає, то вивести штатне повідомлення
            return (
                f"Ступінь {stage_id}: паливо {fuel_level}%, швидкість {speed} м/с"
            )
            



# Задача 3: Середня температура камери згоряння (for / continue)
def calc_average_temp(temps: list) -> float:
    """
    Обчислює середню температуру.
    Пропускає некоректні виміри (< -273 або > 3500) за допомогою continue.
    """
    temp = []   #Пустий спиоск для температур, які нам підходять
    for i in temps:
        if i < -273 or i > 3500:     #Перевірка температури на коректність значень, якщо ні, то пропукаємо їх
            continue
        temp.append(i)               #Якщо температура коректна, то додаємо її до списку temp
    return sum(temp) / len(temp) if temp else 0.0  #Повертаємо середню температуру, якщо список пустий, то 0,0

# Задача 4: Обчислення прискорення (zip)
def count_overload_moments(ax: list, ay: list, az: list) -> int:
    """
    Приймає три паралельні списки прискорень.
    За допомогою zip обчислює a = sqrt(ax^2 + ay^2 + az^2).
    Повертає кількість моментів, коли a > 5g (де g = 9.81 м/с^2).
    """
     g = 9.81
    kilkist = 0 
    for x, y, z in zip(ax, ay, az):  #перебираємо 3 списки
        a = sqrt(x**2 + y**2 + z**2)  #Обчислюємо прискорення за формулою
        if a > 5 * g:                  #Перевірка, якщо прискорення більше ніж 5g, то збільшуємо лічильник
            kilkist += 1
    return kilkist        
